In [2]:
import pandas as pd

In [2]:
#series

#creating series from list
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
# creating series from dictionary
data_dict = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data_dict)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
# assigning custom index
data1 = [10,20,30,40,50]
index=['a','b','c','d','e']
series1 = pd.Series(data1,index=index)
print(series1)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
# dataframe

#creating dataframe from dictionary
avengers = {"Name":["Iron Man","Captain America","Hulk","Spider Man"], 
            "Alias":["Tony Stark","Steve Rogers","Bruce Banner", "Peter Parker"]}

df = pd.DataFrame(avengers)
print(df)

              Name         Alias
0         Iron Man    Tony Stark
1  Captain America  Steve Rogers
2             Hulk  Bruce Banner
3       Spider Man  Peter Parker

In [14]:
# creating dataframe using list of dictionary
avengers = [{"Name":"Iron Man","Alias":"Tony Stark"},{"Name":"Captain America","Alias":"Steve Rogers"},{"Name":"Hulk","Alias":"Bruce Banner"},{"Name":"Spider Man","Alias":"Peter Parker"}]
df = pd.DataFrame(avengers)
print(df)

              Name         Alias
0         Iron Man    Tony Stark
1  Captain America  Steve Rogers
2             Hulk  Bruce Banner
3       Spider Man  Peter Parker

In [46]:
# reading csv file from pandas

df = pd.read_csv('Orders.csv')
# returns first 5 datas from df
df.head()

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [12]:
# returns last 5 datas from df
df.tail()

    Order ID  Order Date CustomerName             State     City
495  B-25742  03-08-2018       Ashwin               Goa      Goa
496  B-26088  26-03-2018       Bhavna            Sikkim  Gangtok
497  B-25707  01-07-2018      Shivani       Maharashtra   Mumbai
498  B-25758  22-08-2018      Shubham  Himachal Pradesh    Simla
499  B-26095  28-03-2018      Monisha         Rajasthan   Jaipur

In [15]:
df

              Name         Alias
0         Iron Man    Tony Stark
1  Captain America  Steve Rogers
2             Hulk  Bruce Banner
3       Spider Man  Peter Parker

In [16]:
# accessing data from dataframe
df["Name"]

0           Iron Man
1    Captain America
2               Hulk
3         Spider Man
Name: Name, dtype: object

In [17]:
df.loc[0]

Name       Iron Man
Alias    Tony Stark
Name: 0, dtype: object

In [19]:
df.iloc[1]

Name     Captain America
Alias       Steve Rogers
Name: 1, dtype: object

In [24]:
# accessing specific elements 
df.at[1,"Name"]

'Captain America'

In [22]:
df.iat[2,1]

'Bruce Banner'

In [25]:
# data manipulation
df

              Name         Alias
0         Iron Man    Tony Stark
1  Captain America  Steve Rogers
2             Hulk  Bruce Banner
3       Spider Man  Peter Parker

In [28]:
# adding new column to the df
df["Superpower"] = ["Billionare, Intelligent","Super Serum","Gamma","Spider"]

In [27]:
df

              Name         Alias               Superpower
0         Iron Man    Tony Stark  Billionare, Intelligent
1  Captain America  Steve Rogers              Super Serum
2             Hulk  Bruce Banner                    Gamma
3       Spider Man  Peter Parker                   Spider

In [31]:
# removing a column from the df
df.drop("Superpower",axis=1,inplace=True)

In [32]:
df

              Name         Alias
0         Iron Man    Tony Stark
1  Captain America  Steve Rogers
2             Hulk  Bruce Banner
3       Spider Man  Peter Parker

In [41]:
df["Age"]=[40,400,45,23]

In [42]:
df

              Name         Alias  Age
0         Iron Man    Tony Stark   40
1  Captain America  Steve Rogers  400
2             Hulk  Bruce Banner   45
3       Spider Man  Peter Parker   23

In [43]:
df["Age"]=df["Age"]+1

In [44]:
df

              Name         Alias  Age
0         Iron Man    Tony Stark   41
1  Captain America  Steve Rogers  401
2             Hulk  Bruce Banner   46
3       Spider Man  Peter Parker   24

In [45]:
# removing data row wise

df.drop(0,inplace=True)

              Name         Alias  Age
1  Captain America  Steve Rogers  401
2             Hulk  Bruce Banner   46
3       Spider Man  Peter Parker   24

In [47]:
df.describe()

       Order ID  Order Date CustomerName        State    City
count       500         500          500          500     500
unique      500         307          336           19      25
top     B-26055  24-11-2018       Shreya  Maharashtra  Indore
freq          1           7            6           94      71